[{"title": "A teacher and tutor of 8 years shares his 6-step secret to keeping kids engaged while learning at home", "link": "https://www.cnbc.com/2020/05/05/teach-tutor-8-years-shares-5-step-secret-to-keeping-kids-engaged-when-learning-at-home.html", "description": "Teaching isn't easy, and different kids learn best in different ways. Here's how to keep your kids busy, excited and engaged while learning at home during the coronavirus pandemic.", "pubdate": "Tue, 05 May 2020 15:21:51 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Ex-Obama Secret Service agent on how to stay mentally tough during trying times", "link": "https://www.cnbc.com/2020/05/05/ex-obama-secret-service-agent-how-to-stay-mentally-tough.html", "description": "Evy Poumpouras says the mental habits she learned as a former Special Agent for more than 12 years (including after the 9/11 terrorist attacks) could be helpful to people amid the Covid-19 pandemic.", "pubdate": "Tue, 05 May 2020 15:18:09 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Why new pet owners say now is the perfect time to adopt", "link": "https://www.cnbc.com/2020/05/05/why-new-pet-owners-say-now-is-the-perfect-time-to-adopt.html", "description": "For many new pet owners, now was the perfect time to bring their new furry friends home. Here's why having a pet has been beneficial.", "pubdate": "Tue, 05 May 2020 13:00:02 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "5 tips if you're considering a career move during the pandemic", "link": "https://www.cnbc.com/2020/05/05/career-advice-tips-for-changing-jobs-during-the-pandemic.html", "description": "The principles, honed over two decades, can keep your career ambitions on course even during hard times, says London Business School professor, Herminia Ibarra.", "pubdate": "Tue, 05 May 2020 01:13:31 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "'Shark Tank': How this fired saleswoman impressed Barbara Corcoran and landed a 6-figure deal", "link": "https://www.cnbc.com/2020/05/04/shark-tank-fired-saleswomans-6-figure-deal-with-barbara-corcoran.html", "description": "Self-made multimillionaire Barbara Corcoran said this fired saleswoman turned entrepreneur \"can sell like crazy,\" on Friday's episode of ABC's \"Shark Tank.\"", "pubdate": "Mon, 04 May 2020 20:29:21 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "How co-working spaces could succeed in the post-pandemic world", "link": "https://www.cnbc.com/2020/05/04/how-co-working-spaces-could-succeed-in-the-post-pandemic-world.html", "description": "With the future remote workforce expected to grow, co-working and community spaces could fill the void left by a reduction in in-office interactions.", "pubdate": "Mon, 04 May 2020 20:15:25 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "What NFL MVP Lamar Jackson is doing to stay mentally tough during self-quarantine", "link": "https://www.cnbc.com/2020/05/04/what-nfl-mvp-lamar-jackson-does-to-stay-mentally-tough-amid-pandemic.html", "description": "While self-quarantining in Baltimore, NFL MVP Lamar Jackson says he's been throwing the football in his backyard, playing video games and working out with his trainers and coaches via Zoom. But he credits his yoga and Pilates practice with keeping his mindset right during the Covid-19 pandemic.", "pubdate": "Mon, 04 May 2020 22:06:29 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Why you should schedule a money chat with your friends", "link": "https://www.cnbc.com/2020/05/04/why-you-should-schedule-a-money-chat-with-your-friends.html", "description": "Whatever you decide to discuss, having a friend or loved one's support can help quell some financial anxiety you are experiencing or encourage you to make progress toward a goal.", "pubdate": "Mon, 04 May 2020 19:20:35 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "2 books Warren Buffett recommends reading now", "link": "https://www.cnbc.com/2020/05/04/2-books-warren-buffett-recommends-reading-now.html", "description": "As Warren Buffett reflected on the previous financial crashes in America during the Berkshire Hathaway Shareholders Meeting on Saturday, the legendary investor recommended two books to read during times of uncertainty.", "pubdate": "Mon, 04 May 2020 20:02:23 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Warren Buffett isn't buying but says one stock market bet still makes sense", "link": "https://www.cnbc.com/2020/05/04/buffett-isnt-buying-but-says-one-stock-market-bet-still-makes-sense.html", "description": "Warren Buffett is uncertain about the economy and market due to the coronavirus and isn't on a buying binge, but he remains sure most people will do best buying an S&P 500 index fund.", "pubdate": "Mon, 04 May 2020 18:39:06 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Sean 'Diddy' Combs released a free meditation to help you sleep", "link": "https://www.cnbc.com/2020/05/03/diddy-and-audible-partner-for-new-meditation-app-to-improve-sleep.html", "description": "Sean \"Diddy\" Combs released a guided meditation on the audiobook site, Audible, that's meant to help you relax before bed and fight fatigue. Here's how to start meditating today.", "pubdate": "Mon, 04 May 2020 20:42:13 GMT", "author": null, "source": "CNBC_Wealth"}]