[{"title": "Nordstrom is preparing to reopen its stores. Here's what the retailer is changing", "link": "https://www.cnbc.com/2020/05/05/coronavirus-nordstrom-is-preparing-to-reopen-its-stores.html", "description": "Nordstrom is preparing to reopen some of its department stores, following the lead of Macy's, offering a glimpse at how shopping will be different coming out of the coronavirus pandemic.", "pubdate": "Tue, 05 May 2020 15:57:14 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "US services sector posts biggest contraction since 2009 as coronavirus halts economic activity", "link": "https://www.cnbc.com/2020/05/05/ism-nonmanufacturing-index-april-2020.html", "description": "The U.S. services sector contracted for the first time in about a decade last month as the coronavirus pandemic brought economic activity in the country to a near-screeching halt.", "pubdate": "Tue, 05 May 2020 15:39:28 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Dr. Scott Gottlieb warns coronavirus cases will keep rising in May as restrictions are lifted", "link": "https://www.cnbc.com/2020/05/05/coronavirus-dr-scott-gottlieb-warns-cases-will-keep-rising-in-may.html", "description": "\"There's really nothing that's going to keep them from ... going down over the course of this month. The hope is that they don't go up a lot,\" Dr. Scott Gottlieb told CNBC on Tuesday.", "pubdate": "Tue, 05 May 2020 14:59:40 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "NYC officials alarmed with rise in rare disease affecting some kids with coronavirus, Mayor de Blasio says", "link": "https://www.cnbc.com/2020/05/05/nyc-officials-alarmed-with-rise-in-rare-disease-affecting-some-kids-with-coronavirus-mayor-says.html", "description": " ", "pubdate": "Tue, 05 May 2020 14:59:49 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Pfizer begins human testing for experimental coronavirus vaccine in the US", "link": "https://www.cnbc.com/2020/05/05/pfizer-begins-human-testing-for-experimental-coronavirus-vaccine-in-the-us.html", "description": "The U.S.-based company, which is working alongside German drugmaker BioNTech, said the first human participants in the United States have been dosed with the potential vaccine, BNT162.", "pubdate": "Tue, 05 May 2020 13:10:42 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Ahead of Disney earnings, chart suggests one key level offers value", "link": "https://www.cnbc.com/2020/05/05/ahead-of-disney-earnings-chart-suggests-one-key-level-offers-value.html", "description": "Disney is about to report earnings. Bill Baruch of Blue Line Capital and Gina Sanchez of Chantico Global discuss what to watch and where it heads from here.", "pubdate": "Tue, 05 May 2020 15:33:46 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "AMC Networks expects a dramatic 30% drop in ad revenue this quarter due to coronavirus", "link": "https://www.cnbc.com/2020/05/05/amc-networks-estimates-a-30percent-drop-in-ad-revenue-in-q2.html", "description": "AMC Networks said it estimates advertising revenue will drop about 30% in the second quarter as marketers pull or delay spend as the coronavirus delays show production.", "pubdate": "Tue, 05 May 2020 15:22:46 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Nearly a fifth of Wendy's US restaurants are out of beef, analyst says", "link": "https://www.cnbc.com/2020/05/05/nearly-a-fifth-of-wendys-us-restaurants-are-out-of-beef-analyst-says.html", "description": "Stephens Inc. said its estimate is based on an analysis of online menus for every Wendy's location nationwide.", "pubdate": "Tue, 05 May 2020 14:12:25 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Responsibility for coronavirus precautions at airports is a 'game of hot potato'", "link": "https://www.cnbc.com/2020/05/05/coronavirus-air-travel-airlines-take-their-own-health-precautions.html", "description": "As government authorities and airlines think about coronavirus health screenings, it isn't clear who's in charge of carrying out new policies.", "pubdate": "Tue, 05 May 2020 13:28:50 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "This wartime law gives Trump exceptional power over US economy", "link": "https://www.cnbc.com/2020/05/05/this-wartime-law-gives-trump-exceptional-power-over-us-economy.html", "description": "President Trump has invoked a Korean War-era law to fight the coronavirus pandemic. The Defense Production Act gives the president extraordinary powers over the U.S. economy, which supporters of the move say is necessary to contain the disease.", "pubdate": "Tue, 05 May 2020 15:12:10 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Disney's parks were its biggest profit-maker, now they could be its biggest drag on earnings", "link": "https://www.cnbc.com/2020/05/05/disneys-parks-could-be-biggest-drag-on-second-quarter-earnings.html", "description": "Last year, Disney's Parks, Experiences and Consumer Products segment was its fastest-growing profit driver. Now, it could be the company's biggest drag on earnings, thanks to the Covid-19 outbreak.", "pubdate": "Tue, 05 May 2020 11:40:50 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Fiat Chrysler to restart US production in two weeks after coronavirus shutdowns lead to $1.8 billion quarterly loss", "link": "https://www.cnbc.com/2020/05/05/fca-fcau-q1-2020-results.html", "description": "Despite the \"unexpected and unprecedented times\" due to Covid-19, the company, said Tuesday that it and French automaker PSA Group \"remain committed\" to a previously announced merger of equals.", "pubdate": "Tue, 05 May 2020 14:59:36 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "One of Main Street's biggest fears in economic reopening — new regulations", "link": "https://www.cnbc.com/2020/05/05/main-street-fears-new-regulation-in-coronavirus-economic-reopening.html", "description": "As small businesses across the country grapple with economic reopening, one of their biggest fears is that new regulations will be a net negative for post-Covid-19 Main Street.", "pubdate": "Tue, 05 May 2020 12:50:57 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Dr. Scott Gottlieb says rare, 'unusual phenomena' affecting kids may be linked to coronavirus", "link": "https://www.cnbc.com/2020/05/05/dr-scott-gottlieb-kawasaki-disease-in-kids-may-have-coronavirus-link.html", "description": "\"There was a notion that this wasn't really affecting kids. It does appear that there are kids being affected by it,\" the former FDA chief told CNBC.", "pubdate": "Tue, 05 May 2020 13:59:46 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Wayfair shares rocket higher as coronavirus-related store closures shift more demand its way", "link": "https://www.cnbc.com/2020/05/05/wayfair-w-earnings-q1-2020.html", "description": "Online furniture retailer Wayfair's net loss widened during the first quarter, as its sales surged nearly 20% from a year ago.", "pubdate": "Tue, 05 May 2020 15:58:13 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Support small businesses with gift cards – but know the risks", "link": "https://www.cnbc.com/2020/05/05/support-small-businesses-with-gift-cards-but-know-the-risks.html", "description": "Purchasing gift cards are a way to support struggling small businesses. But if they don't make it out of the pandemic, you will be out of pocket.", "pubdate": "Tue, 05 May 2020 14:45:36 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Start-up gets $1 billion valuation virtually, as coronavirus shifts Silicon Valley hunt for IPO riches", "link": "https://www.cnbc.com/2020/05/05/start-up-hits-1-billion-virtually-as-virus-shifts-silicon-valley-riches.html", "description": "When VAST Data became a unicorn, valued at over $1 billion, in April, it relied on virtual meetings with investors, as Silicon Valley VCs and the IPO market navigate Covid-19.", "pubdate": "Tue, 05 May 2020 14:26:01 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "Answers to your biggest questions about US stimulus programs for Covid-19 relief", "link": "https://www.cnbc.com/2020/05/05/us-stimulus-program-ppp-loan-forgiveness-and-other-questions-answered.html", "description": "The $2.2 trillion CARES Act has provided several programs to help combat the widespread economic fallout of the coronavirus pandemic, but Americans are still confused. Senior Personal Finance Correspondent Sharon Epperson provides the answers.", "pubdate": "Tue, 05 May 2020 13:06:12 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "United Airlines to cut 30% of management in October and braces pilots for changes as well", "link": "https://www.cnbc.com/2020/05/05/united-airlines-to-cut-30percent-of-management-in-october-and-braces-pilots-for-changes-as-well.html", "description": "United Airlines plans to cut at least 3,400 management and administrative positions in October as the coronavirus pandemic crushes air travel demand, and has told pilots to brace for changes as well, according to two memos seen by Reuters.", "pubdate": "Tue, 05 May 2020 11:17:37 GMT", "author": null, "source": "CNBC_Top_News"}, {"title": "How health savings accounts have adjusted for the coronavirus pandemic", "link": "https://www.cnbc.com/2020/03/30/tap-your-health-savings-account-first-for-medical-costs-amid-pandemic.html", "description": "Health savings accounts, or HSAs, will cover Covid-19-related testing and treatment, among other things.", "pubdate": "Tue, 05 May 2020 13:05:00 GMT", "author": null, "source": "CNBC_Top_News"}]