[{"title": "Will schools be open in September? We asked several experts to weigh in", "link": "https://www.cnbc.com/2020/05/04/will-schools-be-open-in-september-experts-weigh-in.html", "description": "Many unanswered questions about Covid-19 testing, psychology, economic tensions, social distancing and work-from-home curriculum make opening up schools in September a hazy venture.", "pubdate": "Tue, 05 May 2020 15:09:46 GMT", "author": null, "source": "CNBC_Technology"}, {"title": "Amazon engineer quits after he 'snapped' when the company fired workers who called for coronavirus protections", "link": "https://www.cnbc.com/2020/05/04/amazon-engineer-resigns-over-companys-treatment-of-workers.html", "description": "Tim Bray, a senior engineer at Amazon, resigned on Friday over concerns about the company's decision to fire workers who were outspoken critics of its labor practices.", "pubdate": "Mon, 04 May 2020 18:27:55 GMT", "author": null, "source": "CNBC_Technology"}, {"title": "Apple and Google reveal what their coronavirus contact tracing system might look like", "link": "https://www.cnbc.com/2020/05/04/apple-and-google-release-sample-code-for-contract-tracing-apps.html", "description": "Google and Apple are backing a way to trace and notify people who may have been infected with Covid-19 using Bluetooth signals from people's phones anonymously.", "pubdate": "Mon, 04 May 2020 19:11:58 GMT", "author": null, "source": "CNBC_Technology"}, {"title": "FreshDirect co-founder Jason Ackerman said surge in online grocery shopping has led to more venture capital deals", "link": "https://www.cnbc.com/2020/05/04/freshdirect-co-founder-said-surge-in-online-shopping-has-led-to-more-venture-capital.html", "description": "FreshDirect co-founder and former CEO Jason Ackerman said customers' growing interest in online grocery shopping during the coronavirus pandemic has whet venture capital firms' appetites. \"I'm seeing more deals in online grocery ... than I've ever seen before,\" he said.", "pubdate": "Mon, 04 May 2020 18:03:15 GMT", "author": null, "source": "CNBC_Technology"}, {"title": "Big Tech's earnings prove it's immune to the coronavirus", "link": "https://www.cnbc.com/2020/05/04/big-techs-earnings-prove-its-immune-to-the-coronavirus.html", "description": "As many sectors reported devastation from the economic downturn, tech companies have proven largely resilient.", "pubdate": "Mon, 04 May 2020 23:30:48 GMT", "author": null, "source": "CNBC_Technology"}, {"title": "Salesforce will help businesses return to work with a new set of tools it just announced", "link": "https://www.cnbc.com/2020/05/04/salesforce-announces-tools-that-help-businesses-return-to-work.html", "description": "Salesforce launched Work.com, which will have resources such as contact tracing, emergency response management and wellness assessments. It will also have a resource center with information from health experts and business leaders.", "pubdate": "Mon, 04 May 2020 17:46:09 GMT", "author": null, "source": "CNBC_Technology"}]