[{"title": "Millions of Americans are struggling financially. Here's how you can help, without breaking the bank", "link": "https://www.cnbc.com/2020/05/04/how-to-help-americans-during-the-coronavirus-without-busting-the-bank.html", "description": "Whether it is donating your skills to a nonprofit or giving your time to a local food bank, you can help those who are suffering from financial hardship without digging deep into your wallet.", "pubdate": "Mon, 04 May 2020 12:30:01 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Apple CEO Tim Cook: What to read to 'put these times into perspective'", "link": "https://www.cnbc.com/2020/05/04/apple-ceo-tim-cook-recommends-reading-abraham-lincoln-during-covid-19.html", "description": "In a virtual commencement address for The Ohio State University, Apple CEO Tim Cook shared inspiration from an unlikely author. He also shared his hopes for the graduating class of 2020: \"Those who meet times of historical challenge with their eyes and hearts open — forever restless and forever striving — are also those who leave the greatest impact on the lives of others,\" Cook said.", "pubdate": "Mon, 04 May 2020 15:29:33 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Need some extra cash? This quiz tells you what side hustle is right for you", "link": "https://www.cnbc.com/2020/05/04/need-extra-cash-take-this-quiz-to-see-what-side-hustle-is-right-for-you.html", "description": "Choosing a side hustle involves knowing your skills and priorities. Take this quiz to find out which might be the best fit for you.", "pubdate": "Mon, 04 May 2020 14:14:57 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Almost half of America is now carrying credit card debt, and more of it", "link": "https://www.cnbc.com/2020/05/04/almost-half-of-america-now-carrying-credit-card-debt-and-more-of-it.html", "description": "More Americans, and especially millennials, are being forced by the coronavirus economic crash to carry increasing levels of credit card debt.", "pubdate": "Mon, 04 May 2020 13:52:30 GMT", "author": null, "source": "CNBC_Wealth"}, {"title": "Why many employees are hoping to work from home even after the pandemic is over", "link": "https://www.cnbc.com/2020/05/04/why-many-employees-are-hoping-to-work-from-home-even-after-the-pandemic-is-over.html", "description": "Nearly 43% of full-time American workers say they hope to work from home more even after the economy reopens, according to a new survey released by getAbstract.", "pubdate": "Mon, 04 May 2020 13:50:42 GMT", "author": null, "source": "CNBC_Wealth"}]