[{"title": "These 3 tweaks will simplify your money. Because life is complicated enough", "link": "https://www.cnbc.com/2020/05/05/how-to-streamline-your-financial-life-and-get-control-of-your-money.html", "description": "Streamline your money life with a few easy changes and mindset tweaks. Life is difficult enough right now.", "pubdate": "Tue, 05 May 2020 12:30:01 GMT", "author": null, "source": "CNBC_Personal_Finance"}, {"title": "People receiving SSI or VA benefits have until tomorrow to meet this stimulus check deadline", "link": "https://www.cnbc.com/2020/05/04/stimulus-check-deadline-looms-for-ssi-and-va-beneficiaries.html", "description": "Time is running out if you're receiving SSI or VA benefits and want to make sure your children under 17 are included in your stimulus payments. You have just until tomorrow to report your information to the IRS. But beware: Some people have already complained that their checks fall short.", "pubdate": "Tue, 05 May 2020 00:16:44 GMT", "author": null, "source": "CNBC_Personal_Finance"}, {"title": "Businesses continue to apply for a PPP loan. Forgiveness remains uncertain", "link": "https://www.cnbc.com/2020/05/04/forgiveness-remains-uncertain-as-businesses-continue-to-seek-a-ppp-loan.html", "description": "Companies that were able to make the cut and qualify for the Paycheck Protection Program have another fight on the horizon: having their loan forgiven. Here's why it's so hard to figure that out.", "pubdate": "Mon, 04 May 2020 21:43:43 GMT", "author": null, "source": "CNBC_Personal_Finance"}, {"title": "How to rethink your retirement income strategy as more firms cut dividends", "link": "https://www.cnbc.com/2020/05/04/time-to-rethink-your-retirement-income-as-more-firms-cut-dividends.html", "description": "More than 200 stocks this year have reduced or suspended their dividends, 44 of them on the S&P 500 index. Here's how retirees should view those changes.", "pubdate": "Mon, 04 May 2020 17:58:29 GMT", "author": null, "source": "CNBC_Personal_Finance"}, {"title": "Trump is insisting on a payroll tax cut for workers. Why some experts say it's a 'terrible' idea", "link": "https://www.cnbc.com/2020/05/04/trump-wants-a-payroll-tax-cut-why-some-say-its-a-terrible-idea.html", "description": "In a new interview, President Donald Trump has insisted that any new stimulus legislation must include payroll tax cuts for workers. While such a move would give Americans more money in their paychecks, experts say it neglects a key part of the population: the unemployed.", "pubdate": "Mon, 04 May 2020 16:21:25 GMT", "author": null, "source": "CNBC_Personal_Finance"}]